#include<iostream>

#include<ctime>

using namespace std;


// 2. Банкомат.Реалізувати перевантажені функції там, де це необхідно.
// - Є реєстрація користувача(логін по номеру карти(масив  int), пароль(масив int), або логін по номеру телефону(масив int)).
// - Вхід в аккаунт через логін і пароль або через логін      і    номер телефону(масив int).

// - Переказ грошей або на картку або на телефон.
// - Вивід грошей або ціле число(передати int) або дробове число(передати double).Перевірити баланс(на екра).



//1. Сгенерировать десять массивов из случайных чисел.Вывести их и сумму их элементов на экран.Найти среди них один с максимальной суммой элементов.Указать какой он по счету,
//повторно вывести этот массив и сумму его элементов.Заполнение массива и подсчет суммы его элементов оформить в виде отдельной функции.

int main() {
	int const zero=10;
	int arr[zero];
	int max = 0;
	int sum = 0;
	int maxi = 0;
	srand(unsigned(time(NULL)));
	for (int i = 0; i < zero; i++) {
		arr[i] = rand() % 1000 - 20;

		cout << i << ":" << arr[i] << endl;

		if (arr[i] > max) {
			max = arr[i];
			maxi = i;
		}
	}
		
	cout << "Max=" << max << endl;
	cout << "maxi=" << maxi << endl;


	system("pause");
	return 0;
}



